Rachelyan666/weather_clock/stm32_esp32 copy/driver/ntc.c
#include <stdbool.h>
#include <stdint.h>
#include "stm32f10x.h"
#include <math.h>

#define ADC_BUFFER_SIZE 128
static uint16_t adc_buffer[ADC_BUFFER_SIZE];
static bool dma_busy;

#define BETA      3950.0f       // Beta coefficient
#define R_25      10000.0f      // Thermistor resistance at 25°C
#define R_FIXED   10000.0f      // Series resistor (10k typical)
#define ADC_MAX   4095.0f       // 12-bit ADC
#define T0_KELVIN 298.15f       // 25°C in Kelvin


static void adc_gpio_init(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
}

static void adc_init(void)
{
  RCC_ADCCLKConfig(RCC_PCLK2_Div6);

  /* ADC1 configuration ------------------------------------------------------*/
  ADC_InitTypeDef ADC_InitStructure;
  ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
  ADC_InitStructure.ADC_ScanConvMode = ENABLE;
  ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;
  ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
  ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
  ADC_InitStructure.ADC_NbrOfChannel = 1;
  ADC_Init(ADC1, &ADC_InitStructure);

  /* ADC1 regular channel14 configuration */
  ADC_RegularChannelConfig(ADC1, ADC_Channel_0, 1, ADC_SampleTime_55Cycles5);

  /* Enable ADC1 DMA */
  ADC_DMACmd(ADC1, ENABLE);

  /* Enable ADC1 */
  ADC_Cmd(ADC1, ENABLE);

  /* Enable ADC1 reset calibration register */
  ADC_ResetCalibration(ADC1);
  /* Check the end of ADC1 reset calibration register */
  while (ADC_GetResetCalibrationStatus(ADC1))
    ;

  /* Start ADC1 calibration */
  ADC_StartCalibration(ADC1);
  /* Check the end of ADC1 calibration */
  while (ADC_GetCalibrationStatus(ADC1))
    ;

  /* Start ADC1 Software Conversion */
  ADC_SoftwareStartConvCmd(ADC1, ENABLE);
}

static void adc_dma_init(void)
{
  DMA_DeInit(DMA1_Channel1);
  DMA_InitTypeDef DMA_InitStructure;
  DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&ADC1->DR;
  DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)adc_buffer;
  DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
  DMA_InitStructure.DMA_BufferSize = ADC_BUFFER_SIZE;
  DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
  DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
  DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
  DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
  DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
  DMA_InitStructure.DMA_Priority = DMA_Priority_Medium;
  DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
  DMA_Init(DMA1_Channel1, &DMA_InitStructure);
  DMA_ITConfig(DMA1_Channel1, DMA_IT_TC, ENABLE);

  /* Enable DMA1 channel1 */
  // DMA_Cmd(DMA1_Channel1, ENABLE);
}

static void adc_nvic_init(void)
{
  NVIC_InitTypeDef NVIC_InitStructure;

  NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel1_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 5;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
}

void ntc_init(void)
{
  adc_gpio_init();
  adc_init();
  adc_dma_init();
  adc_nvic_init();
}
uint16_t ntc_read(void)
{
  dma_busy = true;
  adc_dma_init();
  DMA_Cmd(DMA1_Channel1, ENABLE);

  while (dma_busy)
    ;

  uint32_t sum = 0;
  for (int i = 0; i < ADC_BUFFER_SIZE; i++)
  {
    sum += adc_buffer[i];
  }
  return sum / ADC_BUFFER_SIZE;
}

void DMA1_Channel1_IRQHandler(void)
{
  if (DMA_GetITStatus(DMA1_IT_TC1))
  {
    DMA_ClearITPendingBit(DMA1_IT_TC1);
    dma_busy = false;
  }
}

int adc_to_temp(uint16_t adc_value)
{
    float voltage_ratio = adc_value / ADC_MAX;
    float resistance = R_FIXED * (voltage_ratio / (1.0f - voltage_ratio));

    float temp_k = 1.0f / (1.0f / T0_KELVIN + logf(resistance / R_25) / BETA);
    float temp_c = temp_k - 273.15f;
    return (int)(temp_c + 0.5f);
}
